Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbu_bf.h
/** \brief Offset for Ifx_EBU_MODCON_Bits.TIMEOUTC */
#define IFX_EBU_MODCON_TIMEOUTC_OFF (8u)

/** \brief Length for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_LEN (8u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_MSK (0xffu)
/** \brief Mask for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_MSK (0xffu)

/** \brief Offset for Ifx_EBU_MODCON_Bits.LOCKTIMEOUT */
#define IFX_EBU_MODCON_LOCKTIMEOUT_OFF (16u)

/** \brief Length for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_MSK (0x1u)
/** \brief Mask for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.FAST_SRI */
#define IFX_EBU_MODCON_FAST_SRI_OFF (25u)

/** \brief Length for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_MSK (0x1u)
/** \brief Mask for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_MODCON_OCDS_SUSP_DIS_OFF (26u)

/** \brief Length for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_MSK (0x1u)
/** \brief Mask for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.BUSSTATE */
#define IFX_EBU_MODCON_BUSSTATE_OFF (30u)

/** \brief Length for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_LEN (1u)

/** \brief Mask for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_MSK (0x1u)
/** \brief Mask for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_MODCON_Bits.ALE */
#define IFX_EBU_MODCON_ALE_OFF (31u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.STS */
#define IFX_EBU_VIEW_2_STS_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.STS */
#define IFX_EBU_VIEW_2_STS_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.STS */
#define IFX_EBU_VIEW_2_STS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.STS */
#define IFX_EBU_VIEW_2_STS_OFF (0u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.LCKABRT */
#define IFX_EBU_VIEW_2_LCKABRT_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.LCKABRT */
#define IFX_EBU_VIEW_2_LCKABRT_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.LCKABRT */
#define IFX_EBU_VIEW_2_LCKABRT_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.LCKABRT */
#define IFX_EBU_VIEW_2_LCKABRT_OFF (1u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.SDTRI */
#define IFX_EBU_VIEW_2_SDTRI_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.SDTRI */
#define IFX_EBU_VIEW_2_SDTRI_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.SDTRI */
#define IFX_EBU_VIEW_2_SDTRI_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.SDTRI */
#define IFX_EBU_VIEW_2_SDTRI_OFF (2u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.CLK_COMB */
#define IFX_EBU_VIEW_2_CLK_COMB_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.CLK_COMB */
#define IFX_EBU_VIEW_2_CLK_COMB_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.CLK_COMB */
#define IFX_EBU_VIEW_2_CLK_COMB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.CLK_COMB */
#define IFX_EBU_VIEW_2_CLK_COMB_OFF (3u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.EXTLOCK */
#define IFX_EBU_VIEW_2_EXTLOCK_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.EXTLOCK */
#define IFX_EBU_VIEW_2_EXTLOCK_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.EXTLOCK */
#define IFX_EBU_VIEW_2_EXTLOCK_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.EXTLOCK */
#define IFX_EBU_VIEW_2_EXTLOCK_OFF (4u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.ARBSYNC */
#define IFX_EBU_VIEW_2_ARBSYNC_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ARBSYNC */
#define IFX_EBU_VIEW_2_ARBSYNC_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ARBSYNC */
#define IFX_EBU_VIEW_2_ARBSYNC_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.ARBSYNC */
#define IFX_EBU_VIEW_2_ARBSYNC_OFF (5u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.ARBMODE */
#define IFX_EBU_VIEW_2_ARBMODE_LEN (2u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ARBMODE */
#define IFX_EBU_VIEW_2_ARBMODE_MSK (0x3u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ARBMODE */
#define IFX_EBU_VIEW_2_ARBMODE_MSK (0x3u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.ARBMODE */
#define IFX_EBU_VIEW_2_ARBMODE_OFF (6u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.TIMEOUTC */
#define IFX_EBU_VIEW_2_TIMEOUTC_LEN (8u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.TIMEOUTC */
#define IFX_EBU_VIEW_2_TIMEOUTC_MSK (0xffu)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.TIMEOUTC */
#define IFX_EBU_VIEW_2_TIMEOUTC_MSK (0xffu)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.TIMEOUTC */
#define IFX_EBU_VIEW_2_TIMEOUTC_OFF (8u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.LOCKTIMEOUT */
#define IFX_EBU_VIEW_2_LOCKTIMEOUT_LEN (8u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.LOCKTIMEOUT */
#define IFX_EBU_VIEW_2_LOCKTIMEOUT_MSK (0xffu)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.LOCKTIMEOUT */
#define IFX_EBU_VIEW_2_LOCKTIMEOUT_MSK (0xffu)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.LOCKTIMEOUT */
#define IFX_EBU_VIEW_2_LOCKTIMEOUT_OFF (16u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.FAST_SRI */
#define IFX_EBU_VIEW_2_FAST_SRI_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.FAST_SRI */
#define IFX_EBU_VIEW_2_FAST_SRI_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.FAST_SRI */
#define IFX_EBU_VIEW_2_FAST_SRI_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.FAST_SRI */
#define IFX_EBU_VIEW_2_FAST_SRI_OFF (25u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_VIEW_2_OCDS_SUSP_DIS_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_VIEW_2_OCDS_SUSP_DIS_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_VIEW_2_OCDS_SUSP_DIS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.OCDS_SUSP_DIS */
#define IFX_EBU_VIEW_2_OCDS_SUSP_DIS_OFF (26u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.BUSSTATE */
#define IFX_EBU_VIEW_2_BUSSTATE_LEN (1u)

