Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbu_bf.h
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.BUSSTATE */
#define IFX_EBU_VIEW_2_BUSSTATE_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.BUSSTATE */
#define IFX_EBU_VIEW_2_BUSSTATE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.BUSSTATE */
#define IFX_EBU_VIEW_2_BUSSTATE_OFF (30u)

/** \brief Length for Ifx_EBU_VIEW_2_Bits.ALE */
#define IFX_EBU_VIEW_2_ALE_LEN (1u)

/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ALE */
#define IFX_EBU_VIEW_2_ALE_MSK (0x1u)
/** \brief Mask for Ifx_EBU_VIEW_2_Bits.ALE */
#define IFX_EBU_VIEW_2_ALE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_VIEW_2_Bits.ALE */
#define IFX_EBU_VIEW_2_ALE_OFF (31u)

/** \brief Length for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_LEN (32u)

/** \brief Mask for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_MSK (0xffffffffu)

/** \brief Offset for Ifx_EBU_ID_Bits.ID_VALUE */
#define IFX_EBU_ID_ID_VALUE_OFF (0u)

/** \brief Length for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.DIP */
#define IFX_EBU_USERCON_DIP_OFF (0u)

/** \brief Length for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_LEN (7u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_MSK (0x7fu)

/** \brief Offset for Ifx_EBU_USERCON_Bits.NAF */
#define IFX_EBU_USERCON_NAF_OFF (1u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_LEN (4u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_MSK (0xfu)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADDIO */
#define IFX_EBU_USERCON_ADDIO_OFF (16u)

/** \brief Length for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_LEN (2u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_MSK (0x3u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.BCEN */
#define IFX_EBU_USERCON_BCEN_OFF (28u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADVIO */
#define IFX_EBU_USERCON_ADVIO_OFF (30u)

/** \brief Length for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_LEN (1u)

/** \brief Mask for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_MSK (0x1u)

/** \brief Offset for Ifx_EBU_USERCON_Bits.ADDLSW */
#define IFX_EBU_USERCON_ADDLSW_OFF (31u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.CFGEND */
#define IFX_EBU_EXTBOOT_CFGEND_OFF (0u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.CFGERR */
#define IFX_EBU_EXTBOOT_CFGERR_OFF (1u)

/** \brief Length for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_LEN (1u)

/** \brief Mask for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_MSK (0x1u)

/** \brief Offset for Ifx_EBU_EXTBOOT_Bits.EBUCFG */
#define IFX_EBU_EXTBOOT_EBUCFG_OFF (31u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.REGENAB */
#define IFX_EBU_ADDRSEL_REGENAB_OFF (0u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.ALTENAB */
#define IFX_EBU_ADDRSEL_ALTENAB_OFF (1u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.WPROT */
#define IFX_EBU_ADDRSEL_WPROT_OFF (2u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_LEN (1u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.GLOBALCS */
#define IFX_EBU_ADDRSEL_GLOBALCS_OFF (3u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_LEN (4u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_MSK (0xfu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.MASK */
#define IFX_EBU_ADDRSEL_MASK_OFF (4u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_LEN (4u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_MSK (0xfu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.ALTSEG */
#define IFX_EBU_ADDRSEL_ALTSEG_OFF (8u)

/** \brief Length for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_LEN (20u)

/** \brief Mask for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_MSK (0xfffffu)

/** \brief Offset for Ifx_EBU_ADDRSEL_Bits.BASE */
#define IFX_EBU_ADDRSEL_BASE_OFF (12u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.FETBLEN */
#define IFX_EBU_BUS_RCON_FETBLEN_OFF (0u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_RCON_FBBMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_RCON_FBBMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_RCON_FBBMSEL_OFF (3u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.FDBKEN */
#define IFX_EBU_BUS_RCON_FDBKEN_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.FDBKEN */
#define IFX_EBU_BUS_RCON_FDBKEN_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.FDBKEN */
#define IFX_EBU_BUS_RCON_FDBKEN_OFF (5u)

