Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbu_bf.h
/** \brief Length for Ifx_EBU_BUS_RCON_Bits.BFCMSEL */
#define IFX_EBU_BUS_RCON_BFCMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.BFCMSEL */
#define IFX_EBU_BUS_RCON_BFCMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.BFCMSEL */
#define IFX_EBU_BUS_RCON_BFCMSEL_OFF (6u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.NAA */
#define IFX_EBU_BUS_RCON_NAA_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.NAA */
#define IFX_EBU_BUS_RCON_NAA_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.NAA */
#define IFX_EBU_BUS_RCON_NAA_OFF (7u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.ECSE */
#define IFX_EBU_BUS_RCON_ECSE_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.ECSE */
#define IFX_EBU_BUS_RCON_ECSE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.ECSE */
#define IFX_EBU_BUS_RCON_ECSE_OFF (16u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.EBSE */
#define IFX_EBU_BUS_RCON_EBSE_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.EBSE */
#define IFX_EBU_BUS_RCON_EBSE_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.EBSE */
#define IFX_EBU_BUS_RCON_EBSE_OFF (17u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.DBA */
#define IFX_EBU_BUS_RCON_DBA_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.DBA */
#define IFX_EBU_BUS_RCON_DBA_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.DBA */
#define IFX_EBU_BUS_RCON_DBA_OFF (18u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.WAITINV */
#define IFX_EBU_BUS_RCON_WAITINV_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.WAITINV */
#define IFX_EBU_BUS_RCON_WAITINV_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.WAITINV */
#define IFX_EBU_BUS_RCON_WAITINV_OFF (19u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.BCGEN */
#define IFX_EBU_BUS_RCON_BCGEN_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.BCGEN */
#define IFX_EBU_BUS_RCON_BCGEN_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.BCGEN */
#define IFX_EBU_BUS_RCON_BCGEN_OFF (20u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.PORTW */
#define IFX_EBU_BUS_RCON_PORTW_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.PORTW */
#define IFX_EBU_BUS_RCON_PORTW_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.PORTW */
#define IFX_EBU_BUS_RCON_PORTW_OFF (22u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.WAIT */
#define IFX_EBU_BUS_RCON_WAIT_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.WAIT */
#define IFX_EBU_BUS_RCON_WAIT_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.WAIT */
#define IFX_EBU_BUS_RCON_WAIT_OFF (24u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.AAP */
#define IFX_EBU_BUS_RCON_AAP_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.AAP */
#define IFX_EBU_BUS_RCON_AAP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.AAP */
#define IFX_EBU_BUS_RCON_AAP_OFF (26u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.LCKABRT */
#define IFX_EBU_BUS_RCON_LCKABRT_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.LCKABRT */
#define IFX_EBU_BUS_RCON_LCKABRT_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.LCKABRT */
#define IFX_EBU_BUS_RCON_LCKABRT_OFF (27u)

/** \brief Length for Ifx_EBU_BUS_RCON_Bits.AGEN */
#define IFX_EBU_BUS_RCON_AGEN_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RCON_Bits.AGEN */
#define IFX_EBU_BUS_RCON_AGEN_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RCON_Bits.AGEN */
#define IFX_EBU_BUS_RCON_AGEN_OFF (28u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.RDDTACS */
#define IFX_EBU_BUS_RAP_RDDTACS_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.RDDTACS */
#define IFX_EBU_BUS_RAP_RDDTACS_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.RDDTACS */
#define IFX_EBU_BUS_RAP_RDDTACS_OFF (0u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.RDRECOVC */
#define IFX_EBU_BUS_RAP_RDRECOVC_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.RDRECOVC */
#define IFX_EBU_BUS_RAP_RDRECOVC_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.RDRECOVC */
#define IFX_EBU_BUS_RAP_RDRECOVC_OFF (4u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.WAITRDC */
#define IFX_EBU_BUS_RAP_WAITRDC_LEN (5u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.WAITRDC */
#define IFX_EBU_BUS_RAP_WAITRDC_MSK (0x1fu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.WAITRDC */
#define IFX_EBU_BUS_RAP_WAITRDC_OFF (7u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.DATAC */
#define IFX_EBU_BUS_RAP_DATAC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.DATAC */
#define IFX_EBU_BUS_RAP_DATAC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.DATAC */
#define IFX_EBU_BUS_RAP_DATAC_OFF (12u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_RAP_EXTCLOCK_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_RAP_EXTCLOCK_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.EXTCLOCK */
#define IFX_EBU_BUS_RAP_EXTCLOCK_OFF (16u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.EXTDATA */
#define IFX_EBU_BUS_RAP_EXTDATA_LEN (2u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.EXTDATA */
#define IFX_EBU_BUS_RAP_EXTDATA_MSK (0x3u)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.EXTDATA */
#define IFX_EBU_BUS_RAP_EXTDATA_OFF (18u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_RAP_CMDDELAY_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_RAP_CMDDELAY_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.CMDDELAY */
#define IFX_EBU_BUS_RAP_CMDDELAY_OFF (20u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.AHOLDC */
#define IFX_EBU_BUS_RAP_AHOLDC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.AHOLDC */
#define IFX_EBU_BUS_RAP_AHOLDC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.AHOLDC */
#define IFX_EBU_BUS_RAP_AHOLDC_OFF (24u)

/** \brief Length for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_LEN (4u)

/** \brief Mask for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_MSK (0xfu)

/** \brief Offset for Ifx_EBU_BUS_RAP_Bits.ADDRC */
#define IFX_EBU_BUS_RAP_ADDRC_OFF (28u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_LEN (3u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_MSK (0x7u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.FETBLEN */
#define IFX_EBU_BUS_WCON_FETBLEN_OFF (0u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.FBBMSEL */
#define IFX_EBU_BUS_WCON_FBBMSEL_OFF (3u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_MSK (0x1u)

/** \brief Offset for Ifx_EBU_BUS_WCON_Bits.NAA */
#define IFX_EBU_BUS_WCON_NAA_OFF (7u)

/** \brief Length for Ifx_EBU_BUS_WCON_Bits.ECSE */
#define IFX_EBU_BUS_WCON_ECSE_LEN (1u)

/** \brief Mask for Ifx_EBU_BUS_WCON_Bits.ECSE */
#define IFX_EBU_BUS_WCON_ECSE_MSK (0x1u)

