Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxEbu_bf.h
/** \brief Length for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_LEN (3u)

/** \brief Mask for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDR_CON_Bits.BANKM */
#define IFX_EBU_SDR_CON_BANKM_OFF (22u)

/** \brief Length for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_CON_Bits.CLKDIS */
#define IFX_EBU_SDR_CON_CLKDIS_OFF (28u)

/** \brief Length for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_LEN (2u)

/** \brief Mask for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDR_CON_Bits.PWR_MODE */
#define IFX_EBU_SDR_CON_PWR_MODE_OFF (29u)

/** \brief Length for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_CON_Bits.SDCMSEL */
#define IFX_EBU_SDR_CON_SDCMSEL_OFF (31u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_LEN (3u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.BURSTL */
#define IFX_EBU_SDR_MOD_BURSTL_OFF (0u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.BTYP */
#define IFX_EBU_SDR_MOD_BTYP_OFF (3u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_LEN (3u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.CASLAT */
#define IFX_EBU_SDR_MOD_CASLAT_OFF (4u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_LEN (7u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_MSK (0x7fu)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.OPMODE */
#define IFX_EBU_SDR_MOD_OPMODE_OFF (7u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.COLDSTART */
#define IFX_EBU_SDR_MOD_COLDSTART_OFF (15u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_LEN (14u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_MSK (0x3fffu)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.XOPM */
#define IFX_EBU_SDR_MOD_XOPM_OFF (16u)

/** \brief Length for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_LEN (2u)

/** \brief Mask for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDR_MOD_Bits.XBA */
#define IFX_EBU_SDR_MOD_XBA_OFF (30u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_LEN (6u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_MSK (0x3fu)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.REFRESHC */
#define IFX_EBU_SDR_REF_REFRESHC_OFF (0u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_LEN (3u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_MSK (0x7u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.REFRESHR */
#define IFX_EBU_SDR_REF_REFRESHR_OFF (6u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.SELFREXST */
#define IFX_EBU_SDR_REF_SELFREXST_OFF (9u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.SELFREX */
#define IFX_EBU_SDR_REF_SELFREX_OFF (10u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.SELFRENST */
#define IFX_EBU_SDR_REF_SELFRENST_OFF (11u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.SELFREN */
#define IFX_EBU_SDR_REF_SELFREN_OFF (12u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.AUTOSELFR */
#define IFX_EBU_SDR_REF_AUTOSELFR_OFF (13u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_LEN (2u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_MSK (0x3u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.ERFSHC */
#define IFX_EBU_SDR_REF_ERFSHC_OFF (14u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_LEN (8u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_MSK (0xffu)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.SELFREX_DLY */
#define IFX_EBU_SDR_REF_SELFREX_DLY_OFF (16u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_LEN (1u)

/** \brief Mask for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_MSK (0x1u)

/** \brief Offset for Ifx_EBU_SDR_REF_Bits.ARFSH */
#define IFX_EBU_SDR_REF_ARFSH_OFF (24u)

/** \brief Length for Ifx_EBU_SDR_REF_Bits.RES_DLY */
#define IFX_EBU_SDR_REF_RES_DLY_LEN (3u)

